insert into athlete (first_name, last_name) 
values ('Константин', 'Рыбалко'),
	   ('Игорь', 'Архипов'),
	   ('Андрей', 'Корнещук'),
	   ('Андрей', 'Тамплон'),
	   ('Василий', 'Лопаткин'),
	   ('Тимур', 'Гуляев'),
	   ('Руслан', 'Мяхтиев'),
	   ('Руслан', 'Манеев'),
	   ('Вадим', 'Елуфимов'),
	   ('Максим', 'Муратов');

insert into CLUB (club_name) 
values ('АРЧ'),
	   ('Форвард'),
	   ('Фараон'),
	   ('Исток'),
	   ('Локомотив'),
	   ('JAB');


insert into ATHLETE_CLUB (athlete_id, club_id) 
values (1, 1),
       (1, 4),
       (2, 1),
       (3, 5),
       (4, 5),
       (3, 4),
       (5, 2),
       (6, 2),
       (7, 2),
       (8, 6),
       (9, 3),
       (10, 6),
       (2, 2);

insert into ATHLETE_SPORT (athlete_id, sport_id, athlete_rank) 
values (1, 2, 6),
	   (1, 4, 3),
	   (2, 1, 7),
	   (3, 5, 5),
	   (4, 5, 4),
	   (3, 4, 3),
	   (2, 2, 2),
	   (5, 1, 7),
	   (6, 1, 1),
	   (7, 2, 6),
	   (8, 2, 4),
	   (9, 3, 8),
	   (10, 3, 10);


insert into COACH (first_name, last_name, sport_id) 
values ('Никита', 'Попов', 4),
	   ('Николай', 'Макаров', 2),
	   ('Павел', 'Дмитренко', 3),
	   ('Петр', 'Поморцев', 1),
	   ('Григорий', 'Опарин', 5);

insert into ATHLETE_COACH (athlete_id, coach_id) 
values (1, 1),
	   (1, 2),
	   (2, 2),
	   (2, 4),
	   (3, 1),
	   (3, 5),
	   (4, 5),
	   (5, 4),
	   (6, 4),
	   (7, 2),
	   (8, 2),
	   (9, 3),
	   (10, 3);

insert into COATING_TYPE (coating_type_name) 
values ('Резина'),
	   ('Газон'),
	   ('Паркет'),
	   ('Татами'),
	   ('Канвас'),
	   ('Грунт');

insert into ATTRIBUTE (capacity, coating_type_id, participants_capacity, track_length) 
values (1000, 5, 230, null),
	   (10000, 6, 100, 800),
	   (525, 5, 170, null),
	   (2000, 3, 130, null),
	   (1500, 2, 200, null),
	   (1500, 1, 150, 400),
	   (5000, 4, 100, null),
	   (1000, 3, 300, null),
	   (500, 1, 50, null),
	   (1000, 6, 110, null),
	   (1, null, 100, null);


insert into TYPE_OF_FACILITY (type_name) 
values ('Ипподром'),
	   ('Стрельбище'),
	   ('Футбольное поле'),
	   ('Игровой зал'),
	   ('Тренажерный зал'),
	   ('Беговая дорожка'),
	   ('Борцовский зал'),
	   ('Ринг'),
	   ('Зал восточных единоборств');

insert into SPORTS_FACILITY (attribute_id, facility_name, facility_type_id) 
values (1, 'Атом', 8),
	   (2, 'Новосибирский ипподром', 1),
	   (3, 'Флагман', 8),
	   (4, 'Дворец спорта', 4),
	   (5, 'Zабей', 3),
	   (6, 'Заря', 6),
	   (7, 'Тайфун', 9),
	   (8, 'Колумб', 4),
	   (9, '727°С', 2),
	   (10, 'Кантрипарк', 2),
	   (11, 'Европа', 5);

insert into KIND_OF_SPORT (sport_name) 
values ('Спортивная стрельба'),
	   ('Кикбоксинг'),
	   ('Фитнес'),
	   ('Баскетбол'),
	   ('Волейбол'),
	   ('Скачки'),
	   ('Футбол'),
	   ('Мини футбол'),
	   ('Бег');


insert into FACILITY_SPORT (facility_id, sport_id) 
values (1, 2),
	   (2, 6),
	   (3, 2),
	   (4, 4),
	   (4, 5),
	   (4, 8),
	   (5, 7),
	   (6, 9),
	   (7, 2),
	   (8, 4),
	   (8, 5),
	   (8, 8),
	   (9, 1),
	   (10, 1),
	   (11, 3);

insert into ORGANIZER (organizer_name) 
values ('Федерация кикбоксинга России'),
	   ('Волейбольный клуб Локомотив-Новосибирск'),
	   ('РЖД'),
	   ('Федерация баскетбола Новосибирской области'),
	   ('Департамент ФК и спорта Новосибирской области');

insert into COMPETITION (sport_id, facility_id, start_date, end_date, competition_name) 
values (1, 9, '2022-08-08 9:00:00', '2022-08-11 18:00:00', 'Чемпионат России по спортивной стрельбе 2022 год'),
	   (2, 1, '2023-03-24 8:00:00', '2023-03-31 20:30:00', 'Чемпионат и первенство СФО по кикбоксингу 2023 год'),
	   (2, 1, '2022-03-20 9:00:00', '2022-03-27 21:00:00', 'Чемпионат и первенство СФО по кикбоксингу 2022 год'),
	   (4, 4, '2012-11-08 8:30:00', '2012-11-08 18:00:00', 'Чемпионат школьной баскетбольной лиги КЭС-БАСКЕТ'),
	   (5, 8, '2023-02-20 13:00:00', '2023-02-20 19:30:00', 'Чемпионат НСО по волейболу 2023 год');


insert into COMPETITION_ORGANIZER (organizer_id, competition_id) 
values (5, 1),
	   (1, 2),
	   (5, 2),
	   (1, 3),
	   (4, 4),
	   (3, 5),
	   (5, 5),
	   (2, 5);


insert into COMPETITION_ATHLETE (competition_id, athlete_id, place) 
values (1, 2, 1),
	   (1, 5, 2),
	   (1, 6, 3),
	   (2, 1, 1),
	   (2, 2, 4),
	   (2, 7, 2),
	   (2, 8, 3),
	   (3, 1, 2),
	   (3, 7, 1),
	   (3, 8, 3),
	   (4, 1, 1),
	   (4, 3, 1),
	   (5, 3, 1),
	   (5, 4, 1);
